backend/node-user-service/tests/load/artillery-config.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 50
      name: "Warm up phase"
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
    - duration: 60
      arrivalRate: 50
      rampTo: 100
      name: "Spike phase"
  processor: "./artillery-functions.js"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "User registration and login"
    flow:
      - function: "generateRandomUser"
      - post:
          url: "/api/auth/register"
          json:
            name: "{{ name }}"
            email: "{{ email }}"
            password: "{{ password }}"
            phone: "{{ phone }}"
            address: "{{ address }}"
          capture:
            - json: "$.token"
              as: "token"
      - think: 3
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
  
  - name: "Generate billing quotes"
    flow:
      - function: "generateRandomPostcodeAndUtilities"
      - post:
          url: "/biller/calculate"
          json:
            postcode: "{{ postcode }}"
            utilities: "{{ utilities }}"
      - think: 2
      - function: "generateRandomUser"
      - post:
          url: "/api/auth/register"
          json:
            name: "{{ name }}"
            email: "{{ email }}"
            password: "{{ password }}"
            phone: "{{ phone }}"
            address: "{{ address }}"
          capture:
            - json: "$.token"
              as: "token"
      - think: 1
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"